app/controllers/records_controller.rb

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
  		@record = Record.find(params[:id])

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 183], ["LIMIT", 1]]
UPDATE "records" SET "dob" = ?, "father" = ?, "mother" = ?, "email" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["dob", ""], ["father", ""], ["mother", ""], ["email", ""], ["updated_at", "2019-12-10 13:55:29.394884"], ["id", 183]]
---
	def update
	    @record = Record.find(params[:id])

	  if @record.update(record_params)

INSERT INTO "records" ("studentid", "sname", "dob", "father", "mother", "phno", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@record = Record.new(record_params)

		if @record.save

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 71], ["LIMIT", 1]]
---
	def show
	    @record = Record.find(params[:id])

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 23]]
---
	def destroy
	  	@record = Record.find(params[:id])
	  	@record.destroy

SELECT "records".* FROM "records"
---
	def destroyAll
		@records = Record.all
		@records.each do |r|

INSERT INTO "records" ("studentid", "sname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["studentid", 62963], ["sname", "student 1"], ["created_at", "2019-12-10 13:45:26.002718"], ["updated_at", "2019-12-10 13:45:26.002718"]]
---
	def duplicate
		10.times do |i|
		num= getRandomNumber()
  		@record=Record.new(studentid: num , sname: "student #{@@count}")
        @record.save

SELECT "records".* FROM "records" WHERE "records"."sname" = ? LIMIT ?  [["sname", "Student 2"], ["LIMIT", 1]]
SELECT 1 AS one FROM "records" WHERE (sname = NULL) LIMIT ?  [["LIMIT", 1]]
---
	def search
		@recordsearch =Record.where("sname = ?", params[:record][:sname])
		if @recordsearch.any?